[
  {
    "title": "NASA's Perseverance Rover Is Midway to Mars ",
    "preview": "Sometimes half measures can be a good thing – especially on a journey this long. The agency's latest rover only has about 146 million miles left to reach its destination."
  },
  {
    "title": "Media Get a Close-Up of NASA's Mars 2020 Rover",
    "preview": "The clean room at NASA's Jet Propulsion Laboratory was open to the media to see NASA's next Mars explorer before it leaves for Florida in preparation for a summertime launch."
  },
  {
    "title": "NASA's MAVEN Explores Mars to Understand Radio Interference at Earth",
    "preview": "NASA’s MAVEN spacecraft has discovered “layers” and “rifts” in the electrically charged part of the upper atmosphere of Mars."
  },
  {
    "title": "The MarCO Mission Comes to an End",
    "preview": "The pair of briefcase-sized satellites made history when they sailed past Mars in 2019."
  },
  {
    "title": "Mars Helicopter Attached to NASA's Perseverance Rover",
    "preview": "The team also fueled the rover's sky crane to get ready for this summer's history-making launch."
  },
  {
    "title": "With Mars Methane Mystery Unsolved, Curiosity Serves Scientists a New One: Oxygen",
    "preview": "For the first time in the history of space exploration, scientists have measured the seasonal changes in the gases that fill the air directly above the surface of Gale Crater on Mars. "
  },
  {
    "title": "Follow NASA's Perseverance Rover in Real Time on Its Way to Mars",
    "preview": "A crisply rendered web application can show you where the agency's Mars 2020 mission is right now as it makes its way to the Red Planet for a Feb. 18, 2021, landing."
  },
  {
    "title": "8 Martian Postcards to Celebrate Curiosity's Landing Anniversary",
    "preview": "The NASA rover touched down eight years ago, on Aug. 5, 2012, and will soon be joined by a second rover, Perseverance."
  },
  {
    "title": "NASA's Mars 2020 Rover Goes Coast-to-Coast to Prep for Launch",
    "preview": "The agency's first step in returning rocks from Mars just arrived at Kennedy Space Center. The Mars 2020 team now begins readying for a launch to the Red Planet this July."
  },
  {
    "title": "Q&A with the Student Who Named Ingenuity, NASA's Mars Helicopter",
    "preview": "As a longtime fan of space exploration, Vaneeza Rupani appreciates the creativity and collaboration involved with trying to fly on another planet."
  },
  {
    "title": "NASA's New Mars Rover Will Use X-Rays to Hunt Fossils",
    "preview": "PIXL, an instrument on the end of the Perseverance rover's arm, will search for chemical fingerprints left by ancient microbes."
  },
  {
    "title": "The Man Who Wanted to Fly on Mars",
    "preview": "The Mars Helicopter is riding to the Red Planet this summer with NASA's Perseverance rover. The helicopter's chief engineer, Bob Balaram, shares the saga of how it came into being."
  },
  {
    "title": "Space History Is Made in This NASA Robot Factory",
    "preview": "From rockets to rovers, JPL's Spacecraft Assembly Facility has been at the center of robotic spaceflight. Here's a closer look at what makes it so special."
  },
  {
    "title": "NASA's Perseverance Rover Mission Getting in Shape for Launch",
    "preview": "Stacking spacecraft components on top of each other is one of the final assembly steps before a mission launches to the Red Planet. "
  },
  {
    "title": "NASA's MAVEN Maps Winds in the Martian Upper Atmosphere that Mirror the Terrain Below and Gives Clues to Martian Climate",
    "preview": "Researchers have created the first map of wind circulation in the upper atmosphere of a planet besides Earth, using data from NASA’s MAVEN spacecraft that were collected during the last two years."
  }
]